#include <bits/stdc++.h> // সব স্ট্যান্ডার্ড লাইব্রেরি একসাথে ইমপোর্ট করা হয়
using namespace std;

int main()
{
    int tc;
    cin >> tc; // কতগুলো টেস্ট কেস আছে, সেটা ইনপুট নিচ্ছি

    while(tc--){ // প্রতিটা টেস্ট কেসের জন্য নিচের ব্লক চালাবে
        int n;
        cin >> n; // এই টেস্ট কেসে অ্যারেতে কতগুলো সংখ্যা আছে

        int a[n]; // অ্যারে ঘোষণা

        // অ্যারেতে ইনপুট নিচ্ছি
        for(int i = 0; i < n; i++){
            cin >> a[i];

            // যদি a[i] == 1 হয় এবং সেটা শেষ উপাদান না হয়
            // তাহলে 1 কে 2 করে দিচ্ছি কারণ 1 দিয়ে যেকোনো সংখ্যাই ভাগ যায়
            if(a[i] == 1 && i < n -1){
                a[i]++; 
            }
        }

        // এখন মূল লজিক: এমনভাবে পরিবর্তন করতে হবে যেন a[i+1] % a[i] ≠ 0 হয়
        for(int i = 0; i < n -1; i++){
            while(a[i +1] % a[i] == 0){ // যতক্ষণ না পরের সংখ্যাটি আগের দ্বারা ভাগ না যায়
                 a[i+1]++; // ততক্ষণ পর্যন্ত a[i+1] তে 1 করে করে বাড়াতে থাকি
            }
        }

        // পরিবর্তনের পর ফলাফল প্রিন্ট করি
        for(int i = 0; i < n; i++){
            cout << a[i] << " ";
        }
        cout << endl;
    }

    return 0;
}
